tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
cask "adoptopenjdk8"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "coreutils"
brew "diff-so-fancy"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mas"
brew "ncdu"
brew "nmap"
brew "node"
brew "nvm"
brew "plantuml"
brew "pstree"
brew "pulumi"
brew "ripgrep"
brew "sshuttle"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
cask "android-file-transfer"
cask "android-platform-tools"
cask "docker"
cask "firefox"
cask "flux"
cask "font-hack"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-noto-mono"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "gimp"
# cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-earth-pro"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "krisp"
cask "linkliar"
cask "meld"
cask "omnidisksweeper"
cask "openvisualtraceroute"
cask "skitch"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
mas "iMovie", id: 408981434
mas "NextDNS", id: 1464122853
mas "Push Mic Control", id: 1155850258
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
