android-file-transfer
android-platform-tools
ccmenu
disk-inventory-x
docker
firefox
flux
font-hack
font-inconsolata
font-iosevka
font-noto-mono
font-noto-sans
font-noto-serif
font-open-sans
font-roboto
font-roboto-mono
font-roboto-slab
font-source-code-pro
font-ubuntu
gimp
google-chrome
google-chrome-canary
hyper
istat-menus
iterm2
java
kdiff3
linkliar
meld
skype
slate
sourcetree
spectacle
spotify
the-unarchiver
transmission
virtualbox
visual-studio-code
vlc
wireshark
