android-file-transfer
android-platform-tools
disk-inventory-x
docker
firefox
flux
gimp
google-chrome
google-chrome-canary
istat-menus
iterm2
java
kdiff3
linkliar
skype
slate
sourcetree
spectacle
spotify
the-unarchiver
transmission
virtualbox
visual-studio-code
vlc
wireshark
